# написать программу по сумме чисел




exit()
sum = lambda a, b: a + b

x = int(input('x: '))
y = int(input('y: '))
print(f'{x} + {y} = {sum(x, y)}')

